DuyTrandeLion/ble-gnss/Project-nRF52840/main.c
#define PASSKEY_TXT                     "Passkey:"                                  /**< Message to be displayed together with the pass-key. */
#define PASSKEY_TXT_LENGTH              8                                           /**< Length of message to be displayed together with the pass-key. */
#define PASSKEY_LENGTH                  6                                           /**< Length of pass-key received by the stack for display. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define TRAVEL_READY                    0
#define TRAVEL_STARTED                  1
#define TRAVEL_PAUSED                   2

BLE_ANS_C_DEF(m_ans_c);                                                             /**< Structure used to identify the Alert Notification Service Client. */
BLE_BAS_DEF(m_bas);                                                                 /**< Structure used to identify the battery service. */
BLE_LNS_DEF(m_lns);                                                                 /**< Location and navigation service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
BLE_DB_DISCOVERY_DEF(m_ble_db_discovery);                                           /**< DB discovery module instance. */

APP_TIMER_DEF(m_battery_timer_id);                                                  /**< Battery timer. */
APP_TIMER_DEF(m_loc_and_nav_timer_id);                                              /**< Location and navigation measurement timer. */

NRF_BLE_GQ_DEF(m_ble_gatt_queue,                                                    /**< BLE GATT Queue instance. */
               NRF_SDH_BLE_PERIPHERAL_LINK_COUNT,
               NRF_BLE_GQ_QUEUE_SIZE);

static pm_peer_id_t m_peer_to_be_deleted = PM_PEER_ID_INVALID;
static uint8_t      m_alert_message_buffer[MESSAGE_BUFFER_SIZE];                    /**< Message buffer for optional notify messages. */
static uint16_t     m_conn_handle        = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static ble_uuid_t   m_adv_uuids[] =                                                 /**< Universally unique service identifiers. */
{
    {BLE_UUID_LOCATION_AND_NAVIGATION_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};
static sensorsim_cfg_t   m_battery_sim_cfg;                                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;                                       /**< Battery Level sensor simulator state. */

static ble_lns_loc_speed_t   m_location_speed;                                      /**< Location and speed. */
static ble_lns_pos_quality_t m_position_quality;                                    /**< Position measurement quality. */
static ble_lns_navigation_t  m_navigation;                                          /**< Navigation data structure. */

static uint8_t m_display_screen_select;
static uint8_t m_travelling_status;

/**@brief String literals for the iOS notification categories. used then printing to UART. */
static char const * lit_catid[BLE_ANS_NB_OF_CATEGORY_ID] =
{
    "Simple alert",
    "Email",
    "News",
    "Incoming call",
    "Missed call",
    "SMS/MMS",
    "Voice mail",
    "Schedule",
    "High prioritized alert",
    "Instant message"
};

static const ble_lns_loc_speed_t initial_lns_location_speed =
{
    .instant_speed_present   = false,
    .total_distance_present  = true,
    .location_present        = true,
    .elevation_present       = true,
    .heading_present         = true,
    .rolling_time_present    = true,
    .utc_time_time_present   = true,
    .position_status         = BLE_LNS_NO_POSITION,
    .data_format             = BLE_LNS_SPEED_DISTANCE_FORMAT_2D,
    .elevation_source        = BLE_LNS_ELEV_SOURCE_POSITIONING_SYSTEM,
    .heading_source          = BLE_LNS_HEADING_SOURCE_COMPASS,
    .instant_speed           = 12,         // = 1.2 meter/second
    .total_distance          = 0,          // = 2356 meters
    .latitude                = -103123567, // = -10.3123567 degrees
    .longitude               = 601234567,  // = 60.1234567 degrees
    .elevation               = 1350,       // = 13.5 meter
    .heading                 = 2123,       // = 21.23 degrees
    .rolling_time            = 0,          // = 1 second
    .utc_time                =
                               {
                                   .year    = 2020,
                                   .month   = 1,
                                   .day     = 1,
                                   .hours   = 0,
                                   .minutes = 0,
                                   .seconds = 0
                                }
};

static const ble_lns_pos_quality_t initial_lns_pos_quality =
{
    .number_of_satellites_in_solution_present = true,
    .number_of_satellites_in_view_present     = true,
    .time_to_first_fix_present                = true,
    .ehpe_present                             = false,
    .evpe_present                             = false,
    .hdop_present                             = true,
    .vdop_present                             = true,
    .position_status                          = BLE_LNS_NO_POSITION,
    .number_of_satellites_in_solution         = 5,
    .number_of_satellites_in_view             = 6,
    .time_to_first_fix                        = 63,  // = 6.3 seconds
    .hdop                                     = 123,
    .vdop                                     = 143
};

