DuyTrandeLion/ble-gnss/Project-nRF52840/main.c
static const ble_lns_navigation_t initial_lns_navigation =
{
    .remaining_dist_present       = false,
    .remaining_vert_dist_present  = false,
    .eta_present                  = false,
    .position_status              = BLE_LNS_NO_POSITION,
    .heading_source               = BLE_LNS_HEADING_SOURCE_COMPASS,
    .navigation_indicator_type    = BLE_LNS_NAV_TO_WAYPOINT,
    .waypoint_reached             = false,
    .destination_reached          = false,
    .bearing                      = 1234,   // = 12.34 degrees
    .heading                      = 2123,   // = 21.23 degrees
    .eta                          =
                                    {
                                       .year    = 2020,
                                       .month   = 1,
                                       .day     = 1,
                                       .hours   = 0,
                                       .minutes = 0,
                                       .seconds = 0
                                    }
};


static void advertising_start(bool erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            pm_conn_sec_status_t conn_sec_status;

            // Check if the link is authenticated (meaning at least MITM).
            err_code = pm_conn_sec_status_get(p_evt->conn_handle, &conn_sec_status);
            APP_ERROR_CHECK(err_code);

            if (conn_sec_status.mitm_protected)
            {
                NRF_LOG_INFO("Link secured. Role: %d. conn_handle: %d, Procedure: %d",
                             ble_conn_state_role(p_evt->conn_handle),
                             p_evt->conn_handle,
                             p_evt->params.conn_sec_succeeded.procedure);
            }
            else
            {
                // The peer did not use MITM, disconnect.
                NRF_LOG_INFO("Collector did not use MITM, disconnecting");
                err_code = pm_peer_id_get(m_conn_handle, &m_peer_to_be_deleted);
                APP_ERROR_CHECK(err_code);
                err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
            }

            break;
        }

        case PM_EVT_CONN_SEC_FAILED:
        {
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;
        }

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            advertising_start(false);
            break;
        }

        default:
            break;
    }
}


/**@brief Callback function for errors in the Location Navigation Service.
 *
 * @details This function will be called in case of an error in the Location Navigation Service.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 */
void lns_error_handler(uint32_t err_code)
{
    app_error_handler(DEAD_BEEF, 0, 0);
}


/**@brief Location Navigation event handler.
 *
 * @details This function will be called for all events of the Location Navigation Module that
 *          are passed to the application.
 *
 * @param[in]   p_evt   Event received from the Location Navigation Module.
 */
static void on_lns_evt(ble_lns_t const * p_lns, ble_lns_evt_t const * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_LNS_CTRLPT_EVT_INDICATION_ENABLED:
            NRF_LOG_INFO("Control Point: Indication enabled");
            break;

        case BLE_LNS_CTRLPT_EVT_INDICATION_DISABLED:
            NRF_LOG_INFO("Control Point: Indication disabled");
            break;

        case BLE_LNS_LOC_SPEED_EVT_NOTIFICATION_ENABLED:
            NRF_LOG_INFO("Location/Speed: Notification enabled");
            break;

        case BLE_LNS_LOC_SPEED_EVT_NOTIFICATION_DISABLED:
            NRF_LOG_INFO("Location/Speed: Notification disabled");
            break;

        case BLE_LNS_NAVIGATION_EVT_NOTIFICATION_ENABLED:
            NRF_LOG_INFO("Navigation: Notification enabled");
            break;

        case BLE_LNS_NAVIGATION_EVT_NOTIFICATION_DISABLED:
            NRF_LOG_INFO("Navigation: Notification disabled");
            break;

        default:
            break;
    }
}


ble_lncp_rsp_code_t on_ln_ctrlpt_evt(ble_lncp_t const * p_lncp, ble_lncp_evt_t const * p_evt)
{
    switch (p_evt->evt_type)
    {
        case LNCP_EVT_MASK_SET:
            NRF_LOG_INFO("LOC_SPEED_EVT: Feature mask set");
            break;

        case LNCP_EVT_TOTAL_DISTANCE_SET:
            NRF_LOG_INFO("LOC_SPEED_EVT: Set total distance: %d", p_evt->params.total_distance);
            m_location_speed.total_distance = p_evt->params.total_distance;
            break;

        case LNCP_EVT_ELEVATION_SET:
            NRF_LOG_INFO("LOC_SPEED_EVT: Set elevation: %d", p_evt->params.elevation);
            break;

        case LNCP_EVT_FIX_RATE_SET:
            NRF_LOG_INFO("POS_QUAL_EVT: Fix rate set to %d", p_evt->params.fix_rate);
            break;

        case LNCP_EVT_NAV_COMMAND:
            NRF_LOG_INFO("NAV_EVT: Navigation state changed to %d", p_evt->params.nav_cmd);
            break;

        case LNCP_EVT_ROUTE_SELECTED:
            NRF_LOG_INFO("NAV_EVT: Route selected %d", p_evt->params.selected_route);
            break;


        default:
            break;
    }

    return (LNCP_RSP_SUCCESS);
}


/**@brief Function for setup of alert notifications in central.
 *
 * @details This function will be called when a successful connection has been established.
 */
static void alert_notification_setup(void)
{
    ret_code_t err_code;

